#include <stdio.h>
#include <stdlib.h>
#include <locale.h>

int main() {
    setlocale(LC_ALL, "Russian");

    int a; scanf("%d", &a);

    if (a == 100) {
        printf("Один рубль\n");
        return EXIT_SUCCESS;
    }

    char* teens[10] = {"Десять", "Одиннадцать", "Двенадцать", "Тринадцать", "Четырнадцать", "Пятнадчать", "Шестнадцать", "Семнадцать", "Восемнадцать", "Девятнадцать"};

    if (a/10 == 1) {
        printf("%s копеек\n", teens[a%10]);
        return EXIT_SUCCESS;
    }

    char* tens[10] = {"", "", "Двадцать", "Тридцать", "Сорок", "Пятьдесят", "Шестьдесят", "Семьдесят", "Восемьдесят", "Девяносто"};
    char* ones[10] = {"копеек", "одна копейка", "две копейки", "три копейки", "четыре копейки", "пять копеек", "шесть копеек", "семь копеек", "восемь копеек", "девять копеек"};

    if (a < 10)
        printf("%s", ones[a%10]);
    else
        printf("%s %s", tens[a/10], ones[a%10]);

    return EXIT_SUCCESS;
}